Scheme2/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.81264 0 0);

boundaryField
{
    "valve.*|walls"
    {
        type            noSlip;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    inlet
    {
        type                    flowRateInletVelocity;
        volumetricFlowRate   constant 0.036233;
	extrapolateProfile	yes;
	value			uniform (0 0 0);
    }
}


// ************************************************************************* //
