Scheme2/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  /* "valve.*|walls"
    {
        type            nutUSpaldingWallFunction;
        type            nutkWallFunction;
        value           $internalField;
    } */
    "valve.*"
    {
        type            nutkRoughWallFunction;
        Ks              uniform 3e-4;
        Cs              uniform 0.5;
	value		$internalField;
    }
    "walls"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }

}


// ************************************************************************* //
