Scheme2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

xa -1.25;
xb 1.25;
ya -0.12;
yb 0.12;
za -0.15;
zb 0.08;

//un 0.0075;
un 0.01;
//un 0.0078;

nx #calc "std::floor(($xb - $xa) / $un)";//120
ny #calc "std::floor(($yb - $ya) / $un)";//95
nz #calc "std::floor(($zb - $za) / $un)";//24
//nz 100;

vertices
(
    ($xa $ya $za) //0
    ($xb $ya $za) //1
    ($xb $yb $za) //2
    ($xa $yb $za) //3
    ($xa $ya $zb) //4
    ($xb $ya $zb) //5
    ($xb $yb $zb) //6
    ($xa $yb $zb) //7
);


blocks
(
//    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) 
    hex (0 1 2 3 4 5 6 7) (125 24 23) 
    simpleGrading
    (
     (
	(0.4 0.3 0.2)
	(0.2 0.4 1)
	(0.4 0.3 5)
     )
     1
     1
    )
);

edges
(
);


boundary
(   
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    walls
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
