Scheme2/system/cuttingPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

cuttingPlane
{
    type            surfaces;
    libs            ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   raw;
    writeFormat     ascii;
    fields          (p U k omega);

    interpolationScheme cellPoint;

    surfaces
    (
        inletface
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (-1.5 0 0);
            normal          (1 0 0);
            interpolate     true;
        }

    );
}


// ************************************************************************* //
